In [2]:
import sqlite3

In [3]:
con = sqlite3.connect('students1.sqlite3')

In [4]:
cur = con.cursor()

In [1]:
create_table_query = """

CREATE TABLE student(
	id int primary key,
	name varchar not null,
	address varchar not null,
	college varchar not null,
	age int not null,
	gender varchar(1) not null,
	faculty varchar not null
);

"""
cur.execute(create_table_query)

NameError: name 'cur' is not defined

In [5]:
insert_records="""
INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty')
values
(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT'),
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT'),
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE'),
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f','CE');

"""
cur.execute(insert_records)

In [6]:
con.commit()

In [7]:
students = cur.execute("SELECT * from student;")
print(students)

<sqlite3.Cursor object at 0x107ec8cc0>

In [5]:
students = cur.execute("SELECT * from student;")
print(next(students))

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'tu')

In [8]:
students = cur.execute("SELECT * from student;")

for student in students:
    print(student)

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT')
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE')

In [9]:
# No need commit for table related operation
cur.execute("ALTER table student add university varchar not null default 'tu';")

In [10]:
students = cur.execute("SELECT * FROM student where address = 'lalitpur';")
for student in students:
    print(student)

(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'tu')

In [11]:
address = input("Enter the address: ")

students = cur.execute(f"""SELECT * FROM student where address = '{address}';""")
for student in students:
    print(student)

Enter the addres:  kathmandu

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'tu')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE', 'tu')

In [12]:
# SQL injection
address = input("Enter the address: ")
students = cur.execute(f"""SELECT * FROM student where address = '{address}';""")
for student in students:
    print(student)

Enter the addres:  lalitpur' or address = 'kathmandu

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'tu')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'tu')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE', 'tu')

In [25]:
# SQL injection
address = input("Enter the address: ")
students = cur.execute(f"""SELECT * FROM student where address = '{address}';""")
for student in students:
    print(student)

Enter the addres:  lalitpur' or true or address = 'kathmandu

(1, 'ram', 'kathmandu', 'ncit', 18, 'm', 'IT', 'tu')
(2, 'shyam', 'lalitpur', 'islington', 20, 'm', 'CSIT', 'tu')
(3, 'gita', 'pokhara', 'ncit', 21, 'f', 'SE', 'tu')
(4, 'sita', 'kathmandu', 'ioe pulchowk', 24, 'f', 'CE', 'tu')
(11, 'ramesh pradhan', 'lalitpur', 'ncit', 23, 'm', 'IT', 'TU')
(8, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', 'SE', 'PU')
(9, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', 'IT', 'UK')
(10, 'maya devi', 'lalitpur', 'ncit', 21, 'f', 'CE', 'PU')
(113, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', 'SE', 'PU')
(114, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', 'IT', 'UK')
(115, 'maya devi', 'lalitpur', 'ncit', 21, 'f', 'CE', 'PU')

In [13]:
# SELECT * FROM student where address = 'lalitpur' or address = 'kathmandu'

In [17]:
address = input("Enter the address: ")

students = cur.execute("""SELECT * FROM student where address = ?;""", (address,))
for student in students:
    print(student)

Enter the addres:  'lalitpur' or address = 'kathmandu'

In [19]:
student = (11, 'ramesh pradhan', 'lalitpur', 'ncit', 23, 'm', "IT", "TU")

INSERT_RECORDS = """

INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty', 'university')
values
(?,?,?,?,?,?,?,?);

"""
cur.execute(INSERT_RECORDS, student)

con.commit()

IntegrityError: UNIQUE constraint failed: student.id

In [20]:
students = [
    (8, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', "SE", "PU"),
    (9, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', "IT", 'UK'),
    (10, 'maya devi', 'lalitpur', 'ncit', 21, 'f', "CE", "PU"),
]

INSERT_RECORDS="""

INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty' ,'university')
values
(?, ?, ?, ?, ?, ?, ?, ?);

"""

for student in students:
    cur.execute(INSERT_RECORDS, student) # single write at a time
    con.commit()

In [21]:
students = [
    (113, 'hari bahadur', 'lalitpur', 'ncit', 23, 'm', "SE", "PU"),
    (114, 'madan bahadur', 'kathmandu', 'british college', 24, 'm', "IT", 'UK'),
    (115, 'maya devi', 'lalitpur', 'ncit', 21, 'f', "CE", "PU"),
]

INSERT_RECORDS="""

INSERT into student 
('id', 'name', 'address', 'college', 'age', 'gender', 'faculty' ,'university')
values
(?, ?, ?, ?, ?, ?, ?, ?);

""" 

cur.executemany(INSERT_RECORDS, students) # insert at once => bulk
con.commit()